conf/src/InformationRegisters/ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте/ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ЭП_ВидыОперацийНадФактическимиТрудозатратами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/ЭП_СтатусПроекта/ЭП_СтатусПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_СтатусПроекта</name>
  <enumValues>
    <name>Действующий</name>
  </enumValues>
  <enumValues>
    <name>Архивный</name>
  </enumValues>
  <enumValues>
    <name>АрхивныйСПросмотром</name>
  </enumValues>
</mdclass:Enum>

conf/src/Enums/ЭП_ВидыОперацийНадФактическимиТрудозатратами/ЭП_ВидыОперацийНадФактическимиТрудозатратами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыОперацийНадФактическимиТрудозатратами</name>
  <enumValues>
    <name>ТрудозатратыКоманды</name>
  </enumValues>
  <enumValues>
    <name>ТрудозатратыРП</name>
  </enumValues>
</mdclass:Enum>

conf/src/CommonForms/ЭП_ВиджетУтвержденияТрудозатратПоПроектам/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеВиджета();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеВиджетаНаКлиенте", 300);
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОтчетУтвержденныеПроекты(Команда)
	
	ТекДата = ТекущаяДата();
	ТекДатаНеделяНазад = ТекДата - (3600 * 24 * 7);
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("НачалоНедели", НачалоНедели(ТекДатаНеделяНазад));
	УсловияОтбора.Вставить("КонецНедели", КонецНедели(ТекДатаНеделяНазад) + 86400);
	УсловияОтбора.Вставить("Параметр", "Основной");
	Оповестить("СменаВарианта", Истина, ЭтаФорма);
	ОткрытьФорму("Отчет.ЭП_РазнесенныеТрудозатраты.Форма", УсловияОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетНеУтвержденныеПроекты(Команда)
	
	ТекДата = ТекущаяДата();
	ТекДатаНеделяНазад = ТекДата - (3600 * 24 * 7); 
	ТекДатаДвеНеделиНазад = ТекДатаНеделяНазад - 86400 * 7;
	УсловияОтбора = Новый Структура;
	УсловияОтбора.Вставить("НачалоНедели", НачалоНедели(ТекДатаДвеНеделиНазад));
	УсловияОтбора.Вставить("КонецНедели", КонецНедели(ТекДатаДвеНеделиНазад) + 86400);
	УсловияОтбора.Вставить("Параметр", "НеделяНазад");
	Оповестить("СменаВарианта", Истина, ЭтаФорма);
	ОткрытьФорму("Отчет.ЭП_РазнесенныеТрудозатраты.Форма", УсловияОтбора);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетНеУтвержденныеПроектыБольшеДвухНедель(Команда)
	
	ТекДата = ТекущаяДата();
	ТекДатаНеделяНазад = ТекДата - (3600 * 24 * 7);
	ТекДатаДвеНеделиНазад = ТекДатаНеделяНазад - 86400 * 7;
	УсловияОтбора = Новый Структура; 
	УсловияОтбора.Вставить("НачалоНедели", НачалоНедели(ТекДатаДвеНеделиНазад));
	УсловияОтбора.Вставить("КонецНедели", КонецНедели(ТекДатаДвеНеделиНазад) + 86400); 
	УсловияОтбора.Вставить("Параметр", "БольшеДвухНедельНазад");
	Оповестить("СменаВарианта", Истина, ЭтаФорма);
	ОткрытьФорму("Отчет.ЭП_РазнесенныеТрудозатраты.Форма", УсловияОтбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеВиджета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Ссылка,
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.Период КАК Период
	|ИЗ
	|	Справочник.Проекты КАК Проекты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте КАК ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте
	|		ПО Проекты.Ссылка = ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.Проект
	|ГДЕ
	|	Проекты.ЭП_Архивный = ЗНАЧЕНИЕ(Перечисление.ЭП_СтатусПроекта.Действующий)
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.Период МЕЖДУ &НачалоПрошлойНедели И &КонецПрошлойНедели
	|	И НЕ Проекты.ПометкаУдаления
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды)
	|	И НЕ Проекты.ЭП_НеОтслеживатьЗакрытиеТрудозатрат";
	
	ТекДата = ТекущаяДата();
	ТекДатаНеделяНазад = ТекДата - (3600 * 24 * 7);
	Запрос.УстановитьПараметр("НачалоПрошлойНедели", НачалоНедели(ТекДатаНеделяНазад));
	Запрос.УстановитьПараметр("КонецПрошлойНедели", КонецНедели(ТекДатаНеделяНазад) + 86401);
	
	РезультатЗапроса = Запрос.Выполнить();			
	СпособОбхода = ОбходРезультатаЗапроса.Прямой;
	ТабЗнач = РезультатЗапроса.Выгрузить(СпособОбхода);
	Количество = ТабЗнач.Количество();
	
	КоличествоНеУтвержденныхПроектов = 0;
	КоличествоУтвержденныхПроектов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Период КАК Период,
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.СрезПоследних КАК ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних
	|ГДЕ
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды)
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект.ЭП_Архивный = ЗНАЧЕНИЕ(Перечисление.ЭП_СтатусПроекта.Действующий)
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Период МЕЖДУ &НачалоПрошлойНедели И &КонецПрошлойНедели
	|	И НЕ ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект.ЭП_НеОтслеживатьЗакрытиеТрудозатрат";
	
	ТекДатаДвеНеделиНазад = ТекДатаНеделяНазад - 86400 * 7; 
	Запрос.УстановитьПараметр("НачалоПрошлойНедели", НачалоНедели(ТекДатаДвеНеделиНазад));
	Запрос.УстановитьПараметр("КонецПрошлойНедели", КонецНедели(ТекДатаНеделяНазад) + 86400);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТабЗначНедельные = РезультатЗапроса.Выгрузить(СпособОбхода);
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Ссылка",ВыборкаДетальныеЗаписи.Проект);
		Отбор.Вставить("Период",ВыборкаДетальныеЗаписи.Период); 
		Строки = ТабЗнач.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 Тогда
			
			КоличествоНеУтвержденныхПроектов = КоличествоНеУтвержденныхПроектов + 1;
			
		Иначе 
			
			КоличествоУтвержденныхПроектов = КоличествоУтвержденныхПроектов + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоНеУтвержденныхПроектов > 0 Тогда  
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок = СтрЗаменить(Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок, 
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок, "Не утвержденные проекты");
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок = Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок + " " 
		+ Строка(КоличествоНеУтвержденныхПроектов);
		
	Иначе
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок = СтрЗаменить(Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок, 
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок, "Не утвержденные проекты");
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок = Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУвтержденныеПроекты.Заголовок + " " 
		+ Строка(КоличествоНеУтвержденныхПроектов);
		
	КонецЕсли;
	
	Если КоличествоУтвержденныхПроектов > 0 Тогда 
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок = СтрЗаменить(Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок, 
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок, "Утвержденные проекты");
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок =  Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок + " " 
		+ Строка(КоличествоУтвержденныхПроектов); 
		
	Иначе
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок = СтрЗаменить(Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок, 
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок, "Утвержденные проекты");
		
		Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок =  Элементы.ГруппаКоманд.ПодчиненныеЭлементы.УтвержденныеПроекты.Заголовок + " " 
		+ Строка(КоличествоУтвержденныхПроектов);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Период КАК Период,
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект КАК Проект
	|ИЗ
	|	РегистрСведений.ЭП_ПодтвержденныеЧасыПоСотрудникамВПроекте.СрезПоследних КАК ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних
	|ГДЕ
	|	ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЭП_ВидыОперацийНадФактическимиТрудозатратами.ТрудозатратыКоманды)
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект.ЭП_Архивный = ЗНАЧЕНИЕ(Перечисление.ЭП_СтатусПроекта.Действующий)
	|	И ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Период МЕЖДУ &НачалоПрошлойНедели И &КонецПрошлойНедели
	|	И НЕ ЭП_ПодтвержденныеЧасыПоСотрудникамВПроектеСрезПоследних.Проект.ЭП_НеОтслеживатьЗакрытиеТрудозатрат";
	
	Запрос.УстановитьПараметр("НачалоПрошлойНедели", НачалоГода('20220724'));
	Запрос.УстановитьПараметр("КонецПрошлойНедели", НачалоНедели(ТекДатаНеделяНазад) + 86400);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	КоличествоНеУтвержденныхПроектовБольшеНедели = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Проект",ВыборкаДетальныеЗаписи.Проект);
		Отбор.Вставить("Период",ВыборкаДетальныеЗаписи.Период); 
		Строки = ТабЗначНедельные.НайтиСтроки(Отбор);
		
		Если Строки.Количество() = 0 Тогда
			
			КоличествоНеУтвержденныхПроектовБольшеНедели = КоличествоНеУтвержденныхПроектовБольшеНедели + 1;
			
		КонецЕсли;
	КонецЦикла; 
	
	Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУтвержденныеПроектыНеделя.Заголовок = СтрЗаменить(Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУтвержденныеПроектыНеделя.Заголовок, 
	Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУтвержденныеПроектыНеделя.Заголовок, "Не утвержденные проекты");
	
	Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУтвержденныеПроектыНеделя.Заголовок = Элементы.ГруппаКоманд.ПодчиненныеЭлементы.НеУтвержденныеПроектыНеделя.Заголовок + " " 
	+ Строка(КоличествоНеУтвержденныхПроектовБольшеНедели); 
		
КонецПроцедуры

 &НаКлиенте
Процедура ОбновитьДанныеВиджетаНаКлиенте()
	
	ОбновитьДанныеВиджета();
	
КонецПроцедуры  

#КонецОбласти
